// Задача 41: Пользователь вводит с клавиатуры M чисел. 
//Посчитайте, сколько чисел больше 0 ввёл пользователь.
//0, 7, 8, -2, -2 -> 2
//1, -7, -567, 89, 223-> 3

void TextTask()
{
    System.Console.WriteLine("Введите с клавиатуры целое число");
}


int NumberValue()
{
    int num = Convert.ToInt32(Console.ReadLine());
    return num;
}


void ExitFunction()
{
    string exitFun = " ";
}
